[P.299]

index=sysmon sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 
(CurrentDirectory!="*Program Files*" AND CurrentDirectory!="*system32*")(Image!="system32*" AND Image!="*Program Files*" AND Image!="*SysWOW64*") 
    [ search index=sysmon sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 
    | rare CurrentDirectory limit=10 showperc=f showcount=f] 
| table Image


[P.302]

index=sysmon sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 ParentImage="c:\\windows\\explorer.exe" 
    [ search index=sysmon sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" 
    | where NOT isnull(Image) AND NOT isnull(ParentImage) 
    | search CommandLine="* del *" 
    | table ParentImage 
    | rename ParentImage AS Image
        ] 
| table Image

[P.305]

index=sysmon sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 
(Image!="C:\\windows*" AND Image!="*Program Files*") 
 [ search index=sysmon sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=3
   (DestinationIp!="10.0.0.0/8" AND  DestinationIp!="172.16.0.0/12" AND DestinationIp!="192.168.0.0/16")
  | stats count(DestinationIp) AS total_count dc(DestinationIp) AS uniq_count by Image
  | where total_count > 50 OR uniq_count > 20
  | table Image]
|table Image


[P.307]

index=sysmon sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 
| where match(Image, "netsh.exe$")
| where NOT isnull(ParentImage)
| table ParentImage, Image, CommandLine
